Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # local_file.file1 will be created
+ resource "local_file" "file1" {
      + content              = "Hello World!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "hello.txt"
      + id                   = (known after apply)
    }

  # local_file.file3 will be created
+ resource "local_file" "file3" {
      + content              = "Hello World 3!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "hello.2txt"
      + id                   = (known after apply)
    }

  # null_resource.test1 will be created
+ resource "null_resource" "test1" {
      + id = (known after apply)
    }

  # null_resource.test2 will be created
+ resource "null_resource" "test2" {
      + id = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://2990-152-37-83-213.ngrok-free.app/lock?id=mikedixson%252Ftftest%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```